dogma2u/A-discord-bot-on-ESP32/MiniMe_Discord_Bot/MiniMe_Discord_Bot.ino
const char* statusToWord(uint8_t status) {
  if (status == 2) return "On";
  if (status == 1) return "Idle";
  if (status == 3) return "DND";
  return "Off";
}

void initTrackedUsers() {
  for (uint8_t i = 0; i < MAX_TRACKED_USERS; i++) {
    trackedUsers[i].active = false;
    trackedUsers[i].userId = "";
    trackedUsers[i].userName = "";
    trackedUsers[i].status = 0;
    trackedUsers[i].useCount24h = 0;
  }
}

void resetUseWindowIfNeeded() {
  unsigned long now = millis();
  if (usesWindowStartMillis == 0) {
    usesWindowStartMillis = now;
    return;
  }
  if (now - usesWindowStartMillis >= USES_WINDOW_MS) {
    usesWindowStartMillis = now;
    for (uint8_t i = 0; i < MAX_TRACKED_USERS; i++) {
      trackedUsers[i].useCount24h = 0;
    }
  }
}

int findUserIndex(const String& userId) {
  if (userId.length() == 0) return -1;
  for (uint8_t i = 0; i < MAX_TRACKED_USERS; i++) {
    if (trackedUsers[i].active && trackedUsers[i].userId == userId) return (int)i;
  }
  return -1;
}

int addOrPickUserSlot(const String& userId, const String& userName) {
  // Return existing slot if present
  int idx = findUserIndex(userId);
  if (idx >= 0) {
    if (userName.length()) trackedUsers[idx].userName = userName;
    return idx;
  }

  // Find inactive slot
  for (uint8_t i = 0; i < MAX_TRACKED_USERS; i++) {
    if (!trackedUsers[i].active) {
      trackedUsers[i].active = true;
      trackedUsers[i].userId = userId;
      trackedUsers[i].userName = userName;
      trackedUsers[i].status = 0;
      trackedUsers[i].useCount24h = 0;
      return (int)i;
    }
  }

  // No free slot: overwrite lowest-use slot.
  uint8_t worst = 0;
  for (uint8_t i = 1; i < MAX_TRACKED_USERS; i++) {
    if (trackedUsers[i].useCount24h < trackedUsers[worst].useCount24h) worst = i;
  }
  trackedUsers[worst].active = true;
  trackedUsers[worst].userId = userId;
  trackedUsers[worst].userName = userName;
  trackedUsers[worst].status = 0;
  trackedUsers[worst].useCount24h = 0;
  return (int)worst;
}

// Called on each allowed command: bump 24h count and treat that user as On.
void recordUserUse(const String& userId, const String& userName) {
  resetUseWindowIfNeeded();
  if (userId.length() == 0) return;
  int idx = findUserIndex(userId);
  if (idx < 0) {
    idx = addOrPickUserSlot(userId, userName);
  }
  if (idx < 0) return;
  if (userName.length()) trackedUsers[idx].userName = userName;
  // Command implies they're at least "On" from a user-experience perspective.
  trackedUsers[idx].status = 2;
  trackedUsers[idx].useCount24h++;
  noteDisplayActivity();
}

// Apply a Gateway presences[] array to tracked users (READY / GUILD_CREATE / GUILD_MEMBERS_CHUNK).
void applyPresencesArray(JsonArray presences) {
  if (presences.isNull()) return;
  for (JsonObject p : presences) {
    const char* uid = p["user"]["id"];
    if (!uid) continue;
    int idx = findUserIndex(String(uid));
    if (idx < 0) continue;
    const char* st = p["status"] | "offline";
    uint8_t newSt = statusFromDiscord(st);
    if (trackedUsers[idx].status != newSt) {
      trackedUsers[idx].status = newSt;
      noteDisplayActivity();
    }
    // Serial.print("[PRESENCE] ");
    // Serial.print(trackedUsers[idx].userName);
    // Serial.print(" -> ");
    // Serial.println(statusToWord(trackedUsers[idx].status));
  }
}

// Gateway OP 8: ask Discord for current presence of the eight tracked user IDs (each cached guild).
void requestTrackedUserPresences() {
  if (cachedGuildCount == 0) return;
  bool any = false;
  for (uint8_t i = 0; i < MAX_TRACKED_USERS; i++) {
    if (trackedUsers[i].active && trackedUsers[i].userId.length()) {
      any = true;
      break;
    }
  }
  if (!any) return;

  for (uint8_t g = 0; g < cachedGuildCount; g++) {
    if (cachedGuildIds[g].length() < 16) continue;
    StaticJsonDocument<768> doc;
    doc["op"] = 8;
    JsonObject d = doc.createNestedObject("d");
    d["guild_id"] = cachedGuildIds[g];
    d["limit"] = 0;
    d["presences"] = true;
    JsonArray ids = d.createNestedArray("user_ids");
    for (uint8_t i = 0; i < MAX_TRACKED_USERS; i++) {
      if (trackedUsers[i].active && trackedUsers[i].userId.length()) {
        ids.add(trackedUsers[i].userId);
      }
    }
    String payload;
    serializeJson(doc, payload);
    gatewayWS.sendTXT(payload);
    // Serial.print("[GW] Request Guild Members (presences) sent for ");
    // Serial.println(cachedGuildIds[g]);
  }
}

// Live PRESENCE_UPDATE: refresh name/status; may occupy a free dashboard slot.
void handlePresenceUpdate(JsonObject d) {
  const char* uid = d["user"]["id"];
  const char* st  = d["status"] | "offline";
  if (!uid) return;

  int idx = findUserIndex(String(uid));
  if (idx < 0) {
    String name = d["user"]["global_name"] | "";
    if (name.length() == 0) {
      name = d["user"]["username"] | "";
    }
    idx = addOrPickUserSlot(String(uid), name);
    if (idx < 0) return;
  }
  String pName = d["user"]["global_name"] | "";
  if (pName.length() == 0) {
    pName = d["user"]["username"] | "";
  }
  if (pName.length()) trackedUsers[idx].userName = pName;
  uint8_t newSt = statusFromDiscord(st);
  if (trackedUsers[idx].status != newSt) {
    trackedUsers[idx].status = newSt;
    noteDisplayActivity();
  }
}

// Status on OLED rows 15-16 only. Dashboard stays up; these two lines show commands / !display.
String transientLine1 = "";
String transientLine2 = "";
String transientLine3 = "";
unsigned long transientUntilMs = 0;

// Dashboard refresh + OLED sleep. Full brightness 1 min, then 15 s dim, then panel off.
unsigned long lastDashMillis = 0;
const unsigned long DASH_REFRESH_MS = 2000;
unsigned long lastDisplayActivityMillis = 0;

// ====== TOUCH WAKE (GPIO 4, capacitive pad) ======
// Built-in ESP32-S3 touch on TOUCH4. Pad on PIN_TOUCH; raw above idleMin + threshold = tap.
unsigned long lastTouchWakeMillis = 0;
unsigned long lastTouchDebugMillis = 0;
uint32_t touchIdleMin = 0;
uint32_t touchRawMax = 0;
volatile bool touchWakePending = false;
bool displayAsleep = false;
const unsigned long DISPLAY_IDLE_MS = 60000UL; // 1 minute full brightness
const unsigned long DISPLAY_DIM_MS = 15000UL; // 15 seconds fade to off
const unsigned long TOUCH_DEBOUNCE_MS = 300;
const uint8_t DISPLAY_CONTRAST_FULL = 255;

// ====== TEMP SENSOR (DS18B20 on PIN_DS18B20) ======
OneWire oneWire(PIN_DS18B20);
DallasTemperature sensors(&oneWire);
// ====== NEOPIXEL (owner !led) ======
Adafruit_NeoPixel pixels(1, RGB_LED_PIN, NEO_GRB + NEO_KHZ800);

